Revit 2027 API
LinkLoadContent.SetLinkDataPath Method
 Sets the Link data path owned by this LinkLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLinkDataPath(
	ModelPath linkPath
)
Public Sub SetLinkDataPath (
	linkPath As ModelPath
)
public:
void SetLinkDataPath(
	ModelPath^ linkPath
)
member SetLinkDataPath :
        linkPath : ModelPath -> unit
Parameters
linkPath ModelPath
 The Links data path set for this LinkLoadContent object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
This path must be a location accessible to Revit. Revit will attempt to load the link from this location.
See Also
Reference
LinkLoadContent Class
Autodesk.Revit.DB Namespace